a = int(input("Введите номер месяца"))
my_dict_season = {1: "зима", 2: "зима",
                  3: "весна", 4: "весна", 5: "весна",
                  6: "лето", 7: "лето", 8: "лето",
                  9: "осень", 10: "осень", 11: "осень",
                  12: "зима"}

my_dict_month = {1: "январь", 2: "февраль", 3: "март", 4: "апрель",
                 5: "май", 6: "июнь", 7: "июль", 8: "август",
                 9: "сентябрь", 10: "октябрь", 11: "ноябрь", 12: "декабрь"}

print(
    "Dict.Введенный месяц " + str(a) + " (" + my_dict_month.get(a) + ") относится к сезону - " + my_dict_season.get(a)
     )

my_list_month = ['январь', 'февраль', 'март', 'апрель', 'май', 'июнь', 'июль', 'август', 'сентябрь', 'октябрь',
                 'ноябрь', 'декабрь']
my_list_season = ['лето', 'осень', 'зима', 'весна']
pos = a - 1
s = "Не определено"

if a in (1, 2, 12):
    s = my_list_season.pop(2)
elif a in (3, 4, 5):
    s = my_list_season.pop(3)
elif a in (6, 7, 8):
    s = my_list_season.pop(0)
elif a in (9, 10, 10):
    s = my_list_season.pop(1)
print("List.Введенный месяц " + str(a) + " (" + my_list_month.pop(pos) + ") относится к сезону - " + str(s))
